Revit 2026 API

# Transaction Properties

---

The Transaction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

Transaction Class

Autodesk.Revit.DB Namespace